20240118070845-initializing_final_fields.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Initializing final Fields</title>
<meta name="author" content="Mikey" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Initializing final Fields</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org335728a">1. Initializing final Fields</a>
<ul>
<li><a href="#org743c6ad">1.1. <span class="underline">Exam Trick</span></a>
<ul>
<li><a href="#org2623a23">1.1.1. <span class="underline">Exam Trick</span></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org335728a" class="outline-2">
<h2 id="org335728a"><span class="section-number-2">1.</span> Initializing final Fields</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">MouseHouse</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">volume</span>;
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">name</span> = <span class="org-string">"The Mouse House"</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Declaration assignment
</span>    {
        volume = 10; <span class="org-comment-delimiter">// </span><span class="org-comment">Instance Initializer assignment
</span>    }
}
</pre>
</div>

<p>
Unlike <code>static</code> class members, though, <code>final instance</code> fields can also be set in a <code>constructor</code>.
The <code>constructor</code> is part of the <b>initialization</b> process, so it is allowed to assign <code>final instance variables</code>.
</p>
</div>
<div id="outline-container-org743c6ad" class="outline-3">
<h3 id="org743c6ad"><span class="section-number-3">1.1.</span> <span class="underline">Exam Trick</span></h3>
<div class="outline-text-3" id="text-1-1">
<p>
By the time the <code>constructor</code> completes, all <code>final instance variables</code> <b>must be assigned</b> a value <b>exactly once</b>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">MouseHouse</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">volume</span>;
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">name</span>;
    <span class="org-keyword">public</span> <span class="org-function-name">MouseHouse</span>() {
        <span class="org-keyword">this</span>.name = <span class="org-string">"Empty House"</span>; <span class="org-comment-delimiter">// </span><span class="org-comment">Constructor assignment
</span>    }
    {
        volume = 10; <span class="org-comment-delimiter">// </span><span class="org-comment">Instance initializer assignment
</span>    }
}
</pre>
</div>

<ul class="org-ul">
<li><code>local final variables</code> which are <b>not</b> required to have a value unless they are actually used.</li>
<li><code>final instance variables</code> <b>must</b> be assigned a value.</li>
</ul>

<p>
If <code>final instance variables</code> are not assigned a value when they are declared or in an <a href="20240118070900-initializing_instances.html#ID-4e6f72b6-5e66-4d26-b9b5-8689fdd01c21">instance initializer</a>, then they <b>must</b> be assigned a value in
the <b>constructor declaration.</b>
Failure to do so will result in a <b>compiler error</b> on the line that declares the constructor.
</p>


<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">MouseHouse</span> {
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">int</span> <span class="org-variable-name">volume</span>;
    <span class="org-keyword">private</span> <span class="org-keyword">final</span> <span class="org-type">String</span> <span class="org-variable-name">type</span>;

    {
        <span class="org-keyword">this</span>.volume = 10;
    }

    <span class="org-keyword">public</span> <span class="org-function-name">MouseHouse</span>(<span class="org-type">String</span> <span class="org-variable-name">type</span>) {
        <span class="org-keyword">this</span>.type = type;
    }

    <span class="org-keyword">public</span> <span class="org-function-name">MouseHouse</span>() { <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>        <span class="org-keyword">this</span>.volume = 2; <span class="org-comment-delimiter">// </span><span class="org-comment">DOES NOT COMPILE
</span>    }
}
</pre>
</div>
</div>
<div id="outline-container-org2623a23" class="outline-4">
<h4 id="org2623a23"><span class="section-number-4">1.1.1.</span> <span class="underline">Exam Trick</span></h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
On the exam, be wary of any instance variables marked <code>final</code>.
</p>

<p>
Make sure they are assigned a value:
</p>
<ol class="org-ol">
<li>In the line where they are declared</li>
<li>In an <a href="20240118070900-initializing_instances.html#ID-4e6f72b6-5e66-4d26-b9b5-8689fdd01c21">instance initializer</a></li>
<li>In a <code>constructor</code>.</li>
</ol>

<p>
They should be assigned a value <b>only once</b>, and failure to assign a value is considered a <b>compiler error</b> in the <code>constructor</code>.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
